# CreateTabControl

## Description
Creates a tab control within a dialog.  The tab control manages the display of multiple panes of information and provides tab buttons that allow the user to swtich between panes.

To create a tab control in a dialog, first define a group for each tab pane.  Add other controls to the groups and arrange them.  Then call CreateTabControl with an id.  Finally, call CreateTabPane for each pane providing the id of the group that defines that pane.

```pascal
PROCEDURE CreateTabControl(
				dialogID : LONGINT;
				itemID   : LONGINT);
```

```python
def vs.CreateTabControl(dialogID, itemID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The id of the dialog that contains this Tab control.|
|itemID|LONGINT|The id of the Tab control.|

## Examples
ComplexDialogLayout2

```pascal
BEGIN
	dialog1 := CreateLayout(GetStr( 0), TRUE, GetStr( 1), GetStr( 2));
	CreateTabControl         (dialog1,  4);

{* Create the dialog items *}
CreateTabControl (dialogID,  4);
CreateGroupBox (dialogID, 105, GetPluginString (4005), TRUE);	{'Project'}
CreateGroupBox (dialogID, 205, GetPluginString (4034), TRUE);	{'Sheet'}
CreateGroupBox (dialogID, 61,  GetPluginString (4061), TRUE);	{'Issue Data'}

dialog1 := CreateLayout(mainDialogTitle, TRUE, GetStr(kOK), GetStr(kCancel));
CreateTabControl          (dialog1, kTabControl);
```
```python
import vs

# Creates a tab control within a dialog.
dialogID = 1
itemID = 2

vs.CreateTabControl(dialogID, itemID)
newObj = vs.LNewObj()  # handle to the newly created object
```

## See Also
VS Functions:
CreateTabPane
| CreateGroupBox
| RunLayoutDialog

## Version
Availability: from VectorWorks10.5

## Category
* Dialogs - Modern